; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Domain: Space Colony Builder
; Description: Models the construction of a space colony, focusing on resource 
;              management and worker coordination to build essential structures.
; Author: Amir Shetaia
; Class: CISC813 - Automated Planning
; Email: a.shetaia@queensu.ca
; Assignment: 9 (Assignment 1 Modelling)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain space-colony-builder)
  (:requirements :strips :negative-preconditions :typing)

  ;;; Types
  ;; - location: Represents different areas in the space colony.
  ;; - resource: Represents materials used in construction.
  ;; - building: Represents the structures to be built in the colony.
  ;; - worker: Represents the workers who perform construction tasks.
  (:types
    location resource building worker
  )

  ;;; Predicates
  ;; - connected: Indicates if two locations are connected on the map.
  ;; - at-location: Tracks the current location of an entity (worker or building).
  ;; - free: Indicates if a location is available for construction.
  ;; - resource-at: Indicates the presence of a resource at a specific location.
  ;; - has-resource: Tracks if a worker is carrying a specific resource.
  ;; - has-resource2: Tracks if a worker is carrying a second resource (for multi-resource buildings).
  ;; - building-complete: Indicates if a building has been fully constructed.
  ;; - building-started: Indicates if a building is under construction.
  ;; - needs: Specifies a resource required by a building.
  ;; - needs2: Specifies a second resource required by a building.
  ;; - requires-building: Specifies a dependency where a building cannot be started until another is complete.
  ;; - worker-available: Tracks if a worker is free to perform tasks.
  ;; - worker-assigned: Tracks if a worker is assigned to a specific building.
  (:predicates
    (connected ?l1 ?l2 - location) ; Locations are connected
    (at-location ?x - (either worker building) ?l - location) ; Entity is at a location
    (free ?l - location) ; Location is available for construction
    (resource-at ?r - resource ?l - location) ; Resource is present at a location
    (has-resource ?w - worker ?r - resource) ; Worker has a specific resource
    (has-resource2 ?w - worker ?r - resource) ; Worker has a second resource
    (building-complete ?b - building) ; Building is fully constructed
    (building-started ?b - building) ; Building is under construction
    (needs ?b - building ?r - resource) ; Building requires a specific resource
    (needs2 ?b - building ?r - resource) ; Building requires a second resource
    (requires-building ?b - building ?req - building) ; Building depends on another building
    (worker-available ?w - worker) ; Worker is free for tasks
    (worker-assigned ?w - worker ?b - building) ; Worker is assigned to a building
  )

  ;;; Actions

  ; Action: move-worker
  ;; - Moves a worker between two connected locations.
  (:action move-worker
    :parameters (?w - worker ?from ?to - location)
    :precondition (and
      (at-location ?w ?from)
      (connected ?from ?to)
      (worker-available ?w)
    )
    :effect (and
      (not (at-location ?w ?from))
      (at-location ?w ?to)
    )
  )

  ; Action: collect-resource
  ;; - Allows a worker to collect a resource from a location.
  (:action collect-resource
    :parameters (?w - worker ?r - resource ?l - location)
    :precondition (and
      (at-location ?w ?l)
      (resource-at ?r ?l)
      (worker-available ?w)
      (not (has-resource ?w ?r))
    )
    :effect (and
      (has-resource ?w ?r)
      (not (resource-at ?r ?l))
    )
  )

  ; Action: collect-resource2
  ;; - Allows a worker to collect a second resource for buildings that need multiple resources.
  (:action collect-resource2
    :parameters (?w - worker ?r - resource ?l - location)
    :precondition (and
      (at-location ?w ?l)
      (resource-at ?r ?l)
      (worker-available ?w)
      (not (has-resource ?w ?r))
      (not (has-resource2 ?w ?r))
    )
    :effect (and
      (has-resource2 ?w ?r)
      (not (resource-at ?r ?l))
    )
  )

  ; Action: start-building
  ;; - Starts construction of a building at a specific location.
  (:action start-building
    :parameters (?w - worker ?b - building ?l - location)
    :precondition (and
      (at-location ?w ?l)
      (worker-available ?w)
      (free ?l)
      (not (building-started ?b))
    )
    :effect (and
      (building-started ?b)
      (worker-assigned ?w ?b)
      (not (worker-available ?w))
      (not (free ?l))
      (at-location ?b ?l)
    )
  )

  ; Action: start-building-with-dependency
  ;; - Starts a building that requires another building to be completed first.
  (:action start-building-with-dependency
    :parameters (?w - worker ?b - building ?l - location ?req - building)
    :precondition (and
      (at-location ?w ?l)
      (worker-available ?w)
      (free ?l)
      (not (building-started ?b))
      (requires-building ?b ?req)
      (building-complete ?req)
    )
    :effect (and
      (building-started ?b)
      (worker-assigned ?w ?b)
      (not (worker-available ?w))
      (not (free ?l))
      (at-location ?b ?l)
    )
  )

  ; Action: complete-building
  ;; - Completes a building that requires one resource.
  (:action complete-building
    :parameters (?w - worker ?b - building ?l - location ?r - resource)
    :precondition (and
      (building-started ?b)
      (worker-assigned ?w ?b)
      (has-resource ?w ?r)
      (needs ?b ?r)
      (at-location ?w ?l)
      (at-location ?b ?l)
      (not (building-complete ?b))
    )
    :effect (and
      (building-complete ?b)
      (not (has-resource ?w ?r))
      (not (worker-assigned ?w ?b))
      (worker-available ?w)
    )
  )

  ; Action: complete-building-two-resources
  ;; - Completes a building that requires two different resources.
  (:action complete-building-two-resources
    :parameters (?w - worker ?b - building ?l - location ?r1 ?r2 - resource)
    :precondition (and
      (building-started ?b)
      (worker-assigned ?w ?b)
      (has-resource ?w ?r1)
      (has-resource2 ?w ?r2)
      (needs ?b ?r1)
      (needs2 ?b ?r2)
      (at-location ?w ?l)
      (at-location ?b ?l)
      (not (building-complete ?b))
    )
    :effect (and
      (building-complete ?b)
      (not (has-resource ?w ?r1))
      (not (has-resource2 ?w ?r2))
      (not (worker-assigned ?w ?b))
      (worker-available ?w)
    )
  )
)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Problem: Space Colony Expansion
; Description: Tasks workers to collect resources and build essential structures 
;              for a functional space colony. Workers must navigate a connected 
;              map to gather resources and construct buildings at designated locations.
; Author: Amir Shetaia
; Class: CISC813 - Automated Planning
; Email: a.shetaia@queensu.ca
; Assignment: 9 (Assignment 1 Modelling)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem colony-construction)
  (:domain space-colony-builder)

  ;;; Objects
  ;;   - Locations: Represent areas in the space colony map.
  ;;   - Workers: Represent the labor force for construction and resource collection.
  ;;   - Resources: Represent the materials required for building.
  ;;   - Buildings: Represent structures that need to be constructed.
  (:objects
    ; Locations in the colony map
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 - location

    ; Workers available for tasks
    worker1 worker2 worker3 - worker

    ; Resources to be collected
    metal energy crystal water oxygen - resource

    ; Buildings to be constructed
    solar-panel habitat laboratory oxygen-generator farm - building
  )

  ;;; Initial State
  ;;   - Map connections define navigable paths between locations.
  ;;   - Free locations indicate where buildings can be constructed.
  ;;   - Resources are available at specific locations.
  ;;   - Workers are initially positioned at different locations and are available for tasks.
  ;;   - Each building has defined resource requirements for completion.
  (:init
    ;; Map connections
    ;; - Locations are connected in a circular layout with additional cross-links.
    (connected loc1 loc2)
    (connected loc2 loc3)
    (connected loc3 loc4)
    (connected loc4 loc5)
    (connected loc5 loc1)
    (connected loc2 loc4)
    (connected loc1 loc3)
    (connected loc5 loc6)
    (connected loc6 loc7)
    (connected loc7 loc1)

    ;; Free locations
    ;; - Locations where construction can begin are marked as free.
    (free loc2)
    (free loc3)
    (free loc4)
    (free loc5)
    (free loc6)
    (free loc7)

    ;; Resource locations
    ;; - Resources are scattered across the map and must be collected by workers.
    (resource-at metal loc2)
    (resource-at energy loc3)
    (resource-at crystal loc4)
    (resource-at water loc6)
    (resource-at oxygen loc7)

    ;; Worker initial states
    ;; - Workers are placed at different starting locations and are available for tasks.
    (at-location worker1 loc1)
    (at-location worker2 loc5)
    (at-location worker3 loc6)
    (worker-available worker1)
    (worker-available worker2)
    (worker-available worker3)

    ;; Building resource requirements
    ;; - Specifies the type of resource required to complete each building.
    (needs solar-panel energy)
    (needs habitat metal)
    (needs laboratory crystal)
    (needs oxygen-generator water)
    (needs farm oxygen)
  )

  ;;; Goal
  ;;   - All buildings must be completed.
  ;;   - Buildings must be located at their designated locations.
  (:goal
    (and
      ;; Completion of all buildings
      (building-complete solar-panel)
      (building-complete habitat)
      (building-complete laboratory)
      (building-complete oxygen-generator)
      (building-complete farm)

      ;; Placement requirements for buildings
      ;; - Each building must be at a specific location after completion.
      (at-location solar-panel loc2)
      (at-location habitat loc3)
      (at-location laboratory loc4)
      (at-location oxygen-generator loc6)
      (at-location farm loc7)
    )
  )
)

; plan
1. (collect-resource worker3 water loc6)
   deleted: (resource-at water loc6)
   added: (has-resource worker3 water)
   goals met: 0 of 10
2. (start-building worker3 oxygen-generator loc6)
   deleted: (worker-available worker3) (free loc6)
   added: (building-started oxygen-generator) (worker-assigned worker3 oxygen-generator) (at-location oxygen-generator loc6)
   goals met: 1 of 10
3. (complete-building worker3 oxygen-generator loc6 water)
   deleted: (has-resource worker3 water) (worker-assigned worker3 oxygen-generator)
   added: (building-complete oxygen-generator) (worker-available worker3)
   goals met: 2 of 10
4. (move-worker worker3 loc6 loc7)
   deleted: (at-location worker3 loc6)
   added: (at-location worker3 loc7)
   goals met: 2 of 10
5. (collect-resource worker3 oxygen loc7)
   deleted: (resource-at oxygen loc7)
   added: (has-resource worker3 oxygen)
   goals met: 2 of 10
6. (start-building worker3 farm loc7)
   deleted: (worker-available worker3) (free loc7)
   added: (building-started farm) (worker-assigned worker3 farm) (at-location farm loc7)
   goals met: 3 of 10
7. (complete-building worker3 farm loc7 oxygen)
   deleted: (has-resource worker3 oxygen) (worker-assigned worker3 farm)
   added: (building-complete farm) (worker-available worker3)
   goals met: 4 of 10
8. (move-worker worker1 loc1 loc2)
   deleted: (at-location worker1 loc1)
   added: (at-location worker1 loc2)
   goals met: 4 of 10
9. (collect-resource worker1 metal loc2)
   deleted: (resource-at metal loc2)
   added: (has-resource worker1 metal)
   goals met: 4 of 10
10. (move-worker worker1 loc2 loc3)
   deleted: (at-location worker1 loc2)
   added: (at-location worker1 loc3)
   goals met: 4 of 10
11. (move-worker worker2 loc5 loc1)
   deleted: (at-location worker2 loc5)
   added: (at-location worker2 loc1)
   goals met: 4 of 10
12. (start-building worker1 habitat loc3)
   deleted: (worker-available worker1) (free loc3)
   added: (building-started habitat) (worker-assigned worker1 habitat) (at-location habitat loc3)
   goals met: 5 of 10
13. (move-worker worker2 loc1 loc2)
   deleted: (at-location worker2 loc1)
   added: (at-location worker2 loc2)
   goals met: 5 of 10
14. (complete-building worker1 habitat loc3 metal)
   deleted: (has-resource worker1 metal) (worker-assigned worker1 habitat)
   added: (building-complete habitat) (worker-available worker1)
   goals met: 6 of 10
15. (move-worker worker2 loc2 loc4)
   deleted: (at-location worker2 loc2)
   added: (at-location worker2 loc4)
   goals met: 6 of 10
16. (move-worker worker3 loc7 loc1)
   deleted: (at-location worker3 loc7)
   added: (at-location worker3 loc1)
   goals met: 6 of 10
17. (move-worker worker3 loc1 loc2)
   deleted: (at-location worker3 loc1)
   added: (at-location worker3 loc2)
   goals met: 6 of 10
18. (collect-resource worker2 crystal loc4)
   deleted: (resource-at crystal loc4)
   added: (has-resource worker2 crystal)
   goals met: 6 of 10
19. (start-building worker2 laboratory loc4)
   deleted: (worker-available worker2) (free loc4)
   added: (building-started laboratory) (worker-assigned worker2 laboratory) (at-location laboratory loc4)
   goals met: 7 of 10
20. (complete-building worker2 laboratory loc4 crystal)
   deleted: (has-resource worker2 crystal) (worker-assigned worker2 laboratory)
   added: (building-complete laboratory) (worker-available worker2)
   goals met: 8 of 10
21. (move-worker worker3 loc2 loc3)
   deleted: (at-location worker3 loc2)
   added: (at-location worker3 loc3)
   goals met: 8 of 10
22. (collect-resource worker3 energy loc3)
   deleted: (resource-at energy loc3)
   added: (has-resource worker3 energy)
   goals met: 8 of 10
23. (move-worker worker3 loc3 loc4)
   deleted: (at-location worker3 loc3)
   added: (at-location worker3 loc4)
   goals met: 8 of 10
24. (move-worker worker3 loc4 loc5)
   deleted: (at-location worker3 loc4)
   added: (at-location worker3 loc5)
   goals met: 8 of 10
25. (move-worker worker3 loc5 loc1)
   deleted: (at-location worker3 loc5)
   added: (at-location worker3 loc1)
   goals met: 8 of 10
26. (move-worker worker3 loc1 loc2)
   deleted: (at-location worker3 loc1)
   added: (at-location worker3 loc2)
   goals met: 8 of 10
27. (start-building worker3 solar-panel loc2)
   deleted: (worker-available worker3) (free loc2)
   added: (building-started solar-panel) (worker-assigned worker3 solar-panel) (at-location solar-panel loc2)
   goals met: 9 of 10
28. (complete-building worker3 solar-panel loc2 energy)
   deleted: (has-resource worker3 energy) (worker-assigned worker3 solar-panel)
   added: (building-complete solar-panel) (worker-available worker3)
   goals met: 10 of 10
